Autodesk.Revit.DB.CADLinkType.LoadFrom(Autodesk.Revit.DB.ExternalResourceReference)
Loads or reloads the DWG link from the given external resource reference.
Remarks:
If the link is currently loaded, any changes made in-memory
to the link's shared coordinates will be discarded.
Graphic overrides will be preserved on reload.
If the original view used to bring in this link has
been deleted, Revit will cancel the load.
If there is already another link, not current link itself,
using the given external resource reference, the loading will not happen.
The element id of the link using the external resource reference will be contained
in the LinkLoadResult.
This function checks the actual resource path that the IExternalResourceServer returns.
If the link type identified by the resource path doesn't match DWG, the load will not proceed.
resourceReference:
An ExternalResourceReference giving the location of the
link. This method can be used to load the link from a
file on disk. See Autodesk::Revit::DB::ExternalResourceReference::CreateLocalResource().
Returns:
An object containing the ElementId of the link
and an enum value indicating any
errors which occurred while trying to load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support CAD links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This CADLinkType represents an import and cannot be used as a link.
-or-
The element "this CADLinkType" is in a read-only document.
-or-
The link does not represent a DWG.
Since:
2018

Autodesk.Revit.DB.CADLinkType.LoadFrom(System.String)
Loads or reloads the DWG link from the given file path.
Remarks:
If the link is currently loaded, any changes made in-memory
to the link's shared coordinates will be discarded.
Graphic overrides will be preserved on reload.
If the original view used to bring in this link has
been deleted, Revit will cancel the load.
If there is already another link, not current link itself,
using the given file path, the loading will not happen.
The element id of the link using the file path will be contained
in the LinkLoadResult.
If the link type identified by the given path doesn't match DWG,
the load will not proceed.
path:
A path on disk giving the location of the linked file. This path
must be absolute. The link's path will remain PathType.Absolute
or PathType.Relative, whichever it was before. If the link was
previously to an external server location, the path type will be
relative.
Returns:
An object containing the ElementId of the link
and an enum value indicating any
errors which occurred while trying to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given path does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This CADLinkType represents an import and cannot be used as a link.
-or-
The element "this CADLinkType" is in a read-only document.
-or-
The link does not represent a DWG.
Since:
2018

Autodesk.Revit.DB.CADLinkType.Reload(Autodesk.Revit.DB.CADLinkOptions)
Loads or reloads the link from its currently-stored location. If the link is an
external resource, Revit will contact the IExternalResourceServer to get the latest version
of the link.
Remarks:
If the link is currently loaded, any changes made in-memory
to the link's shared coordinates will be discarded.
options:
Options for reloading the link. Options include
the ability to preserve graphic overrides on reload.
Returns:
An object containing the ElementId of the link
and an enum value indicating any
errors which occurred while trying to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This CADLinkType represents an import and cannot be used as a link.
-or-
The element "this CADLinkType" is in a read-only document.
Since:
2018